//myAge гэсэн хувьсагч зарлаж. 25 аас дээш байвал console дээр “above 25” гэж гаргах, 25 аас доош байвал console дээр “below 25” гэж гаргах

// let myAge = 23;

// if (myAge > 25) {
//   console.log("Нас 25 аас дээш байна");
// } else {
//   console.log("Нас 25 аас доош байна");
// }

//n хувьсагчын утгын дагуу сондгой эсвэл тэгш олж хэвлэнэ. жишээ нь: n = 2 байвал it’s even number гэж console дээр гарж ирэх

//if … else ашиглан 12, 45, 30 хамгийн их утгатай хувьсагчийг console дээр хэвлэнэ үү

// if … else ашиглан 12, 45, 30 хамгийн бага утгатай хувьсагчийг console дээр хэвлэнэ үү

// let a = 12;
// let b = 45;
// let c = 30;
// if (a > b && a > c) {
//   console.log(a + " нь хамгийн их утгатай");
// } else if (b > a && b > c) {
//   console.log(b + " нь хамгийн их утгатай");
// } else {
//   console.log(c + " нь хамгийн их утгатай");
// }

// Амралтын өдөр эсвэл ажлын өдөр эсэхийг шалгаарай.weekNumber гэсэн хувьсагч зарлаж weekNumber -ийн тоон утгаа prompt аас авна. жишээ нь: weekNumber = 2 гэж prompt оруулсан байвал “Мягмар-ажлын өдөр” гэж console дээр гарж ирэх

// 4 н хувьсагч зарлан 85, 75, 96, 69 гэсэн тоон утга өгөх. Өгөгдсөн 4 тооны 80-аас их тоонуудын нийлбэрийг ол: 80-аас их тоонуудын нийлбэр - 181
// let a = 85;
// let b = 75;
// let c = 96;
// let d = 69;
// let sum = 0;
// if (a > 80) {
//   sum = sum + a;
// }
// if (b > 80) {
//   sum = sum + b;
// }
// if (c > 80) {
//   sum = sum + c;
// }
// if (d > 80) {
//   sum = sum + d;
// }
// console.log(sum);

// const numbers = [85, 75, 96, 69];
// let sum = 0;
// for (let i = 0; i < numbers.length; i++) {
//   if (numbers[i] > 80) {
//     sum = sum + numbers[i];
//   }
// }
// console.log(sum);

// 4 н хувьсагч зарлан 3, 7, 2, 4 гэсэн тоон утга өгөх.Өгөгдсөн 4 тооны 5-аас бага тоонуудын үржвэрийг ол. 5-аас бага тоонуудын үржвэр - 24

//Багш сурагчдын эцсийн шалгалтын дүнг дүгнэхээр болжээ
// Бат - 67 оноо, Очир - 59 оноо авчээШалгалтын онооноос хамааран багш тодорхой дүнгийн жагсаалт гаргах ёстой бөгөөд энэ нь
// a. Хэрвээ оноо 60 хувиас доош байвал (60 орохгүй) - Маш мууb. Хэрвээ оноо 60 - 70 хооронд байвал - Хангалттайc. Хэрвээ оноо 70 - 80 хооронд байвал - Дундd. Хэрвээ оноо 80 - 90 хооронд байвал - Сайнe. Хэрвээ оноо 90 - 100 хооронд байвал - Маш сайн гэсэн үнэлгээг өгч байгаа юм
// Тэгвэл тухайн сурагчдыг тэнцсэн болоод тэнцээгүй эсэхийг жагсааж доорх хэлбэрээр
// НЭР - АВСАН ОНОО - ҮНЭЛГЭЭ гэсэн маягаар console дээр харуулна уу.

let name1 = "Bat";
let name2 = "Ochir";
let scoreBat = 67;
let scoreOchir = 59;
if (scoreBat < 60) {
  console.log(name1 + scoreBat + "mash muu");
}
if (scoreOchir < 60) {
  console.log(name2 + " " + scoreOchir + " " + " mash muu");
}
